export const TEMPLATES = [
    {
        id: 0,
        number: '0125',
        name: 'Образец шаблона доходного договора Рамочный - Поставка ГП',
        link: '/#100',
        filter: [0, 4, 8, 10],
        subvid: 'Подвид 1',
        add: '4'
    },
    {
        id: 1,
        number: '45',
        name: 'Образец шаблона расходного договора Рамочный и Услуги 441',
        link: '/#101',
        filter: [1, 4, 8, 12],
        subvid: 'Подвид 1',
        add: '6'
    },
    {
        id: 2,
        number: '341',
        name: 'Образец шаблона ВГО договора с Разовый и Аренда',
        link: '/#102',
        filter: [2, 4, 9, 15],
        subvid: 'Подвид 2',
        add: 'Тип 1'
    },
    {
        id: 3,
        number: '4799',
        name: 'Образец шаблона Без фин. об-в. договора Рамочный Поставка - (Закупки)',
        link: '/#103',
        filter: [3, 4, 8, 11],
        subvid: 'Подвид А',
        add: 'Тип 4'
    },
    {
        id: 4,
        number: '1',
        name: 'Дополнительное соглашение Без фин. об-в. Дополняющее на закупку Лицензии с дополнением EU №15',
        link: '/#104',
        filter: [3, 5, 7, 14],
        subvid: 'Подвид Л',
        add: 'EU'
    },
    {
        id: 5,
        number: '9995',
        link: '/#105',
        name: 'Договор Расходный Разовый на закупку Лицензии с дополнением RDA -4535',

        filter: [1, 4, 9, 14, 23, 30]
    },
    {
        id: 6,
        number: '3799',
        name: 'Дополнительное соглашение Вго Корректирующие',
        link: '/#106',
        filter: [2, 5, 6]
    },
    {
        id: 7,
        number: '7219',
        name: 'Образец шаблона расходного договора Рамочный и Поставки (Закупки)',
        link: '/#101',
        filter: [1, 4, 8, 11],
        subvid: 'Подвид ЧН',
        add: 'Stack'
    }
    // ...generateTemplates(7, 30)
]

/*
0:  name: 'Доходный'
1:  name: 'Расходный'
2:  name: 'Вго'
3:  name: 'Без фин. об-в.'

4:  name: 'Договор'
5:  name: 'Доп. соглашение'

6:  name: 'Корректирующие'
7:  name: 'Дополняющие'
8:  name: 'Рамочный'
9:  name: 'Разовый'

10: name: 'Поставка ГП'
11: name: 'Поставка (Закупки)'
12: name: 'Услуги'
13: name: 'Работы (подряд)'
14: name: 'Лицензия'
15: name: 'Аренда'
16: name: 'Поставка'
17: name: 'Купля продажа НВИ'
18: name: 'Соглашение об ЭДО'
19: name: 'Банковские гарантии'
20: name: 'Купля продажа'
21: name: 'Работы'
22: name: 'ГПХ'
23: name: 'Пожертвования'
24: name: 'Спонсорский'
25: name: 'Энергоснабжение'
26: name: 'Информационное консультирование'
27: name: 'Займ'
28: name: 'Поставка ГП (SI)'
29: name: 'NDA'
30: name: 'Агентский'
*/
